In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Employee_Salary_Dataset.csv')

In [3]:
ndf = df

In [7]:
ndf.shape

(35, 5)

In [8]:
ndf.head()

   ID  Experience_Years  Age  Gender  Salary
0   1                 5   28  Female  250000
1   2                 1   21    Male   50000
2   3                 3   23  Female  170000
3   4                 2   22    Male   25000
4   5                 1   17    Male   10000

In [9]:
ndf.tail()

    ID  Experience_Years  Age  Gender   Salary
30  31                10   34    Male    80000
31  32                15   54    Male   900000
32  33                20   55  Female  1540000
33  34                19   53  Female  9300000
34  35                16   49    Male  7600000

In [10]:
ndf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID                35 non-null     int64
 1   Experience_Years  35 non-null     int64
 2   Age               35 non-null     int64
 3   Gender            35 non-null     object
 4   Salary            35 non-null     int64
dtypes: int64(4), object(1)
memory usage: 1.5+ KB

In [11]:
ndf.describe()

              ID  Experience_Years        Age        Salary
count  35.000000          35.00000  35.000000  3.500000e+01
mean   18.000000           9.20000  35.485714  2.059147e+06
std    10.246951           7.55295  14.643552  3.170124e+06
min     1.000000           1.00000  17.000000  3.000000e+03
25%     9.500000           2.50000  22.500000  2.250000e+04
50%    18.000000           6.00000  29.000000  2.500000e+05
75%    26.500000          15.00000  53.500000  3.270000e+06
max    35.000000          27.00000  62.000000  1.000000e+07

In [14]:
ndf.isnull().sum()

ID                  0
Experience_Years    0
Age                 0
Gender              0
Salary              0
dtype: int64

In [37]:
median = ndf[['Experience_Years','Age','Salary']].median()
mode = ndf[['Experience_Years','Age','Salary']].mode()

In [40]:
median

Experience_Years         6.0
Age                     29.0
Salary              250000.0
dtype: float64

In [41]:
mode

   Experience_Years   Age  Salary
0               2.0  54.0   25000
1               NaN   NaN  250000

In [19]:
ndf2 = ndf.groupby('Gender')

In [25]:
for female,male in ndf2:
    print(female)
    print(male)

Female
    ID  Experience_Years  Age  Gender    Salary
0    1                 5   28  Female    250000
2    3                 3   23  Female    170000
6    7                19   54  Female    800000
7    8                 2   21  Female      9000
8    9                10   36  Female     61500
9   10                15   54  Female    650000
10  11                 4   26  Female    250000
15  16                 4   27  Female     87000
16  17                10   34  Female    930000
17  18                15   54  Female   7900000
23  24                 1   21  Female      6000
24  25                 4   23  Female      8900
25  26                 3   22  Female     20000
27  28                27   62  Female  10000000
28  29                19   54  Female   5000000
29  30                 2   21  Female      6100
32  33                20   55  Female   1540000
33  34                19   53  Female   9300000
Male
    ID  Experience_Years  Age Gender   Salary
1    2                 1   21   Male    50000
3    4                 2   22   Male    25000
4    5                 1   17   Male    10000
5    6                25   62   Male  5001000
11  12                 6   29   Male  1400000
12  13                14   39   Male  6000050
13  14                11   40   Male   220100
14  15                 2   23   Male     7500
18  19                 2   21   Male    15000
19  20                10   36   Male   330000
20  21                15   54   Male  6570000
21  22                 4   26   Male    25000
22  23                 5   29   Male  6845000
26  27                 1   18   Male     3000
30  31                10   34   Male    80000
31  32                15   54   Male   900000
34  35                16   49   Male  7600000

In [52]:
ndf2[['Experience_Years','Age','Salary']].median()

        Experience_Years   Age    Salary
Gender
Female               7.5  31.0  250000.0
Male                 6.0  29.0  220100.0

In [53]:
ndf2[['Experience_Years','Age','Salary']].min()

        Experience_Years  Age  Salary
Gender
Female                 1   21    6000
Male                   1   17    3000

In [54]:
ndf2[['Experience_Years','Age','Salary']].max()

        Experience_Years  Age    Salary
Gender
Female                27   62  10000000
Male                  25   62   7600000

In [55]:
ndf2[['Experience_Years','Age','Salary']].mean()

        Experience_Years        Age        Salary
Gender
Female         10.111111  37.111111  2.054917e+06
Male            8.235294  33.764706  2.063626e+06